In [2]:
import numpy as np
import pandas as pd

In [3]:
data = {
    'Name': ['Akku', 'Atiya', 'Peter', 'Linda'],
    'Age': [22, 18, 34, 45],
    'City': ['New York', 'Paris', 'Berlin', 'London'],
    'Salary': [50000, 20000, 30000, 40000],
}
pd.DataFrame(data)

    Name  Age      City  Salary
0   Akku   22  New York   50000
1  Atiya   18     Paris   20000
2  Peter   34    Berlin   30000
3  Linda   45    London   40000

In [4]:
data_list = [
    ['Akku', 22, 'New York', 50000],
    ['Atiya', 18, 'Paris', 20000],
    ['Peter', 22, 'Berlin', 30000],
    ['Linda', 22, 'London', 40000]
]
df = pd.DataFrame(data_list)


columns = ['Name', 'Age', 'City', 'Salary']
df = pd.DataFrame(data_list, columns = columns)
df

    Name  Age      City  Salary
0   Akku   22  New York   50000
1  Atiya   18     Paris   20000
2  Peter   22    Berlin   30000
3  Linda   22    London   40000

In [5]:
df['Name']

0     Akku
1    Atiya
2    Peter
3    Linda
Name: Name, dtype: object

In [7]:
df[['Name', 'Age']]

    Name  Age
0   Akku   22
1  Atiya   18
2  Peter   22
3  Linda   22

In [13]:
df['Designation'] = ['Eng', 'Doctor', 'Doctor', 'Eng']

In [14]:
df

    Name  Age      City  Salary Degignation Designation
0   Akku   22  New York   50000         Eng         Eng
1  Atiya   18     Paris   20000      Doctor      Doctor
2  Peter   22    Berlin   30000      Doctor      Doctor
3  Linda   22    London   40000         Eng         Eng

In [32]:
df.drop(['Designation', 'City'], axis = 1) # Axis 1 for Vertical

    Name  Age  Salary
0   Akku   22   50000
1  Atiya   18   20000
2  Peter   22   30000
3  Linda   22   40000

In [30]:
df.drop(2, axis = 0) # Axis 0 for horizontal

    Name  Age      City  Salary Designation
0   Akku   22  New York   50000         Eng
1  Atiya   18     Paris   20000      Doctor
3  Linda   22    London   40000         Eng

In [33]:
df

    Name  Age      City  Salary Designation
0   Akku   22  New York   50000         Eng
1  Atiya   18     Paris   20000      Doctor
2  Peter   22    Berlin   30000      Doctor
3  Linda   22    London   40000         Eng

In [38]:
df.loc[0]

Name               Akku
Age                  22
City           New York
Salary            50000
Designation         Eng
Name: 0, dtype: object

In [40]:
df.loc[[0, 1]]

    Name  Age      City  Salary Designation
0   Akku   22  New York   50000         Eng
1  Atiya   18     Paris   20000      Doctor

In [39]:
df.loc[3]

Name            Linda
Age                22
City           London
Salary          40000
Designation       Eng
Name: 3, dtype: object

In [43]:
df.loc[[0, 1]]

    Name  Age      City  Salary Designation
0   Akku   22  New York   50000         Eng
1  Atiya   18     Paris   20000      Doctor

In [44]:
df.loc[[0, 1]][['City', 'Salary']]

       City  Salary
0  New York   50000
1     Paris   20000

In [45]:
df.loc[[2, 3]]

    Name  Age    City  Salary Designation
2  Peter   22  Berlin   30000      Doctor
3  Linda   22  London   40000         Eng

In [46]:
df.loc[[2,3]][['Name','Age']]

    Name  Age
2  Peter   22
3  Linda   22

In [47]:
# Condinal Selection

In [48]:
df

    Name  Age      City  Salary Designation
0   Akku   22  New York   50000         Eng
1  Atiya   18     Paris   20000      Doctor
2  Peter   22    Berlin   30000      Doctor
3  Linda   22    London   40000         Eng

In [55]:
# I only want to see those whose age is 20+
df[df['Age'] > 20]

    Name  Age      City  Salary Designation
0   Akku   22  New York   50000         Eng
2  Peter   22    Berlin   30000      Doctor
3  Linda   22    London   40000         Eng

In [58]:
# I only want whose age is above 20 and city from new york
df[(df['Age'] > 20) & (df['City'] == 'New York')]

   Name  Age      City  Salary Designation
0  Akku   22  New York   50000         Eng